{
    "class": "Cleric",
    "subClass": "Tempest",
    "name": "Caesar",
    "race": "Hadozee",
    "level": 6,
    "maxHitPoints": 32,
    "armorClass": 15,
    "hitDie": "d8",
    "abilities": {
        "strength": 12,
        "dexterity": 12,
        "constitution": 14,
        "intelligence": 12,
        "wisdom": 15,
        "charisma": 8
    },
    "speed": 30,
    "skills": [
        "religion",
        "insight"
    ],
    "spells": [
        {
            "name": "Thunderwave",
            "castingTime": "1 action",
            "range": "Self (15 foot cube)",
            "duration": "Instantaneous",
            "level": "1",
            "school": "Evocation",
            "description": "A wave of thunderous force sweeps out from you. Each creature in a 15-foot cube originating from you must make a Constitution saving throw. On a failed save, a creature takes 2d8 thunder damage and is pushed 10 feet away from you. On a successful save, the creature takes half as much damage and isn't pushed.\nIn addition, unsecured objects that are completely within the area of effect are automatically pushed 10 feet away from you by the spell's effect, and the spell emits a thunderous boom audible out to 300 feet.",
            "higherLevels": "When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d8 for each slot level above 1st.",
            "imageSrc": "./icons/thunderwave.png"
        },
        {
            "name": "Spirit Gurdians",
            "castingTime": "1 action",
            "range": "Self (15 foot radius)",
            "duration": "Concentration, up to 10 minutes",
            "level": "3",
            "school": "Conjuration",
            "description": "You call forth spirits to protect you. They flit around you to a distance of 15 feet for the duration. If you are good or neutral, their spectral form appears angelic or fey (your choice). If you are evil, they appear fiendish.\nWhen you cast this spell, you can designate any number of creatures you can see to be unaffected by it. An affected creature's speed is halved in the area, and when the creature enters the area for the first time on a turn or starts its turn there, it must make a Wisdom saving throw. On a failed save, the creature takes 3d8 radiant damage (if you are good or neutral) or 3d8 necrotic damage (if you are evil). On a successful save, the creature takes half as much damage.",
            "higherLevels": "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d8 for each slot level above 3rd.",
            "imageSrc": "./icons/spirit_guardians.png"
        },
        {
            "name": "Shatter",
            "castingTime": "1 action",
            "range": "60 feet",
            "duration": "Instantaneous",
            "level": "2",
            "school": "Evocation",
            "description": "A sudden loud ringing noise, painfully intense, erupts from a point of your choice within range. Each creature in a 10-foot-radius sphere centered on that point must make a Constitution saving throw. A creature takes 3d8 thunder damage on a failed save, or half as much damage on a successful one. A creature made of inorganic material such as stone, crystal, or metal has disadvantage on this saving throw.\nA nonmagical object that isn't being worn or carried also takes the damage if it's in the spell's area.",
            "higherLevels": "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd.",
            "imageSrc": "./icons/shatter.png"
        },
        {
            "name": "Fog Cloud",
            "castingTime": "1 action",
            "range": "120 feet",
            "duration": "Concentration, up to 1 hour",
            "level": "1",
            "school": "Conjuration",
            "description": "You create a 20-foot-radius sphere of fog centered on a point within range. The sphere spreads around corners, and its area is heavily obscured. It lasts for the duration or until a wind of moderate or greater speed (at least 10 miles per hour) disperses it.",
            "higherLevels": "When you cast this spell using a spell slot of 2nd level or higher, the radius of the fog increases by 20 feet for each slot level above 1st.",
            "imageSrc": "./icons/fog_cloud.png"
        },
        {
            "name": "Gust of Wind",
            "castingTime": "1 action",
            "range": "Self (60 foot line)",
            "duration": "Concentration, up to 1 minute",
            "level": "2",
            "school": "Evocation",
            "description": "A line of strong wind 60 feet long and 10 feet wide blasts from you in a direction you choose for the spell's duration. Each creature that starts its turn in the line must succeed on a Strength saving throw or be pushed 15 feet away from you in a direction following the line.\nAny creature in the line must spend 2 feet of movement for every 1 foot it moves when moving closer to you.\nThe gust disperses gas or vapor, and it extinguishes candles, torches, and similar unprotected flames in the area. It causes protected flames, such as those of lanterns, to dance wildly and has a 50 percent chance to extinguish them.\nAs a bonus action on each of your turns before the spell ends, you can change the direction in which the line blasts from you.",
            "higherLevels": "No effect",
            "imageSrc": "./icons/gust_of_wind.webp"
        },
        {
            "name": "Call Lightning",
            "castingTime": "1 action",
            "range": "120 feet",
            "duration": "Concentration, up to 10 minutes",
            "level": "3",
            "school": "Conjuration",
            "description": "A storm cloud appears in the shape of a cylinder that is 10 feet tall with a 60-foot radius, centered on a point you can see within range directly above you. The spell fails if you can't see a point in the air where the storm cloud could appear (for example, if you are in a room that can't accommodate the cloud).\nWhen you cast the spell, choose a point you can see under the cloud. A bolt of lightning flashes down from the cloud to that point. Each creature within 5 feet of that point must make a Dexterity saving throw. A creature takes 3d10 lightning damage on a failed save, or half as much damage on a successful one. On each of your turns until the spell ends, you can use your action to call down lightning in this way again, targeting the same point or a different one.\nIf you are outdoors in stormy conditions when you cast this spell, the spell gives you control over the existing storm instead of creating a new one. Under such conditions, the spell's damage increases by 1d10.",
            "higherLevels": "When you cast this spell using a spell slot of 4th or higher level, the damage increases by 1d10 for each slot level above 3rd.",
            "imageSrc": "./icons/call_lightning.webp"
        },
        {
            "name": "Sleet Storm",
            "castingTime": "1 action",
            "range": "120 feet",
            "duration": "Concentration, up to 1 minute",
            "level": "3",
            "school": "Conjuration",
            "description": "Until the spell ends, freezing rain and sleet fall in a 20-foot-tall cylinder with a 40-foot radius centered on a point you choose within range. The area is heavily obscured, and exposed flames in the area are doused.\nThe ground in the area is covered with slick ice, making it difficult terrain. When a creature enters the spell's area for the first time on a turn or starts its turn there, it must make a Dexterity saving throw. On a failed save, it falls prone.\nIf a creature starts its turn in the spell's area and is concentrating on a spell, the creature must make a successful Constitution saving throw against your spell save DC or lose concentration.",
            "higherLevels": "No effect",
            "imageSrc": "./icons/sleet_storm.png"
        },
        {
            "name": "Guidance",
            "castingTime": "1 action",
            "range": "Touch",
            "duration": "Concentration, up to 1 minute",
            "level": "Cantrip",
            "school": "Divination",
            "description": "You touch one willing creature. Once before the spell ends, the target can roll a d4 and add the number rolled to one ability check of its choice. It can roll the die before or after making the ability check. The spell then ends.",
            "higherLevels": "No effect",
            "imageSrc": "./icons/guidance.webp"
        },
        {
            "name": "Sacred Flame",
            "castingTime": "1 action",
            "range": "60 feet",
            "duration": "Instantaneous",
            "level": "Cantrip",
            "school": "Evocation",
            "description": "Flame-like radiance descends on a creature that you can see within range. The target must succeed on a Dexterity saving throw or take 1d8 radiant damage. The target gains no benefit from cover for this saving throw.",
            "higherLevels": "The spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).",
            "imageSrc": "./icons/sacred_flame.webp"
        },
        {
            "name": "Word of Radiance",
            "castingTime": "1 action",
            "range": "5 feet",
            "duration": "Instantaneous",
            "level": "Cantrip",
            "school": "Evocation",
            "description": "You utter a divine word, and burning radiance erupts from you. Each creature of your choice that you can see within range must succeed on a Constitution saving throw or take 1d6 radiant damage.",
            "higherLevels": "The spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).",
            "imageSrc": "./icons/word_of_radiance.webp"
        },
        {
            "name": "Healing Word",
            "castingTime": "1 bonus action",
            "range": "60 feet",
            "duration": "Instantaneous",
            "level": "1",
            "school": "Evocation",
            "description": "A creature of your choice that you can see within range regains hit points equal to 1d4 + your spellcasting ability modifier. This spell has no effect on undead or constructs.",
            "higherLevels": "When you cast this spell using a spell slot of 2nd level or higher, the healing increases by 1d4 for each slot level above 1st.",
            "imageSrc": "./icons/healing_word.webp"
        },
        {
            "name": "Guiding Bolt",
            "castingTime": "1 action",
            "range": "120 feet",
            "duration": "1 round",
            "level": "1",
            "school": "Evocation",
            "description": "A flash of light streaks toward a creature of your choice within range. Make a ranged spell attack against the target. On a hit, the target takes 4d6 radiant damage, and the next attack roll made against this target before the end of your next turn has advantage, thanks to the mystical dim light glittering on the target until then.",
            "higherLevels": "When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st.",
            "imageSrc": "./icons/guiding_bolt.webp"
        },
        {
            "name": "Shield of Faith",
            "castingTime": "1 bonus action",
            "range": "60 feet",
            "duration": "Concentration, up to 10 minutes",
            "level": "1",
            "school": "Abjuration",
            "description": "A shimmering field appears and surrounds a creature of your choice within range, granting it a +2 bonus to AC for the duration.",
            "higherLevels": "No effect",
            "imageSrc": "./icons/shield_of_faith.webp"
        },
        {
            "name": "Prayer of Healing",
            "castingTime": "10 minutes",
            "range": "30 feet",
            "duration": "Instantaneous",
            "level": "2",
            "school": "Evocation",
            "description": "Up to six creatures of your choice that you can see within range each regain hit points equal to 2d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs.",
            "higherLevels": "When you cast this spell using a spell slot of 3rd level or higher, the healing increases by 1d8 for each slot level above 2nd.",
            "imageSrc": "./icons/prayer_of_healing.webp"
        },
        {
            "name": "Hold Person",
            "castingTime": "1 action",
            "range": "60 feet",
            "duration": "Concentration, up to 1 minute",
            "level": "2",
            "school": "Enchantment",
            "description": "Choose a humanoid that you can see within range. The target must succeed on a Wisdom saving throw or be paralyzed for the duration. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the spell ends on the target.",
            "higherLevels": "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional humanoid for each slot level above 2nd. The humanoids must be within 30 feet of each other when you target them.",
            "imageSrc": "./icons/hold_person.webp"
        },
        {
            "name": "Lesser Restoration",
            "castingTime": "1 action",
            "range": "Touch",
            "duration": "Instantaneous",
            "level": "2",
            "school": "Abjuration",
            "description": "You touch a creature and can end either one disease or one condition afflicting it. The condition can be blinded, deafened, paralyzed, or poisoned.",
            "higherLevels": "No effect",
            "imageSrc": "./icons/lesser_restoration.webp"
        },
        {
            "name": "Mass Healing Word",
            "castingTime": "1 bonus action",
            "range": "Touch",
            "duration": "Instantaneous",
            "level": "3",
            "school": "Evocation",
            "description": "As you call out words of restoration, up to six creatures of your choice that you can see within range regain hit points equal to 1d4 + your spellcasting ability modifier. This spell has no effect on undead or constructs.",
            "higherLevels": "When you cast this spell using a spell slot of 4th level or higher, the healing increases by 1d4 for each slot level above 3rd.",
            "imageSrc": "./icons/mass_healing_word.webp"
        },
        {
            "name": "Shocking Grasp",
            "castingTime": "1 action",
            "range": "Touch",
            "duration": "Instantaneous",
            "level": "Cantrip",
            "school": "Evocation",
            "description": "Lightning springs from your hand to deliver a shock to a creature you try to touch. Make a melee spell attack against the target. You have advantage on the attack roll if the target is wearing armor made of metal. On a hit, the target takes 1d8 lightning damage, and it can't take reactions until the start of its next turn.",
            "higherLevels": "The spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).",
            "imageSrc": "./icons/shocking_grasp.webp"
        }
    ],
    "classAbilities": [
        {
            "name": "Channel Divinity: Turn Undead",
            "description": "As an action, you present your holy symbol and speak a prayer censuring the undead. Each undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes any damage.\nA turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly move to a space within 30 feet of you. It also can't take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the Dodge action.",
            "imageSrc": "./icons/turn_undead.webp"
        },
        {
            "name": "Channel Divinity: Destroy Undead",
            "description": "Starting at 5th level, when an undead fails its saving throw against your Turn Undead feature, the creature is instantly destroyed if its challenge rating is at or below a certain threshold, as shown in the Cleric table above.",
            "imageSrc": "./icons/destroy_undead.webp"
        },
        {
            "name": "Wrath of the Storm",
            "description": "Also at 1st level, you can thunderously rebuke attackers. When a creature within 5 feet of you that you can see hits you with an attack, you can use your reaction to cause the creature to make a Dexterity saving throw. The creature takes 2d8 lightning or thunder damage (your choice) on a failed saving throw, and half as much damage on a successful one.\nYou can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a long rest.",
            "imageSrc": "./icons/wrath_of_the_storm.webp"
        },
        {
            "name": "Channel Divinity: Destructive Wrath",
            "description": "Starting at 2nd level, you can use your Channel Divinity to wield the power of the storm with unchecked ferocity.\nWhen you roll lightning or thunder damage, you can use your Channel Divinity to deal maximum damage, instead of rolling.",
            "imageSrc": "./icons/destructive_wrath.webp"
        },
        {
            "name": "Thunderous Strike",
            "description": "At 6th level, when you deal lightning damage to a Large or smaller creature, you can also push it up to 10 feet away from you.",
            "imageSrc": "./icons/thunderous_strike.webp"
        }
    ],
    "equipment": [
        {
            "name": "Warhammer",
            "damage": "1d8 (1d10 when wielded with two hands)",
            "damageType": "Bludgeoning",
            "weaponType": "hammer, martial",
            "range": "melee (5 feet)",
            "imageSrc": "./icons/warhammer.png"
        },
        {
            "name": "Light Crossbow",
            "damage": "1d8",
            "damageType": "Piercing",
            "weaponType": "crossbow, simple",
            "range": "80 feet (320 feet with disadvantage)",
            "imageSrc": "./icons/light_crossbow.png"
        }
    ]
}